Repository: 84000/data-translation-memory
Catalog: toh202-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ངེས་པ་དང་མ་ངེས་པར་འགྲོ་བའི་ཕྱག་རྒྱ་ལ་འཇུག་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra Evaluating Whether Progress is Certain or Uncertain

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དྲུག་ཅུ་ལ་འདི་ལྟ་སྟེ།
en: The Blessed One was dwelling on Vulture Peak Mountain in Rājagṛha, along with a great saṅgha of 1,250 bhikṣus.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། མཐུ་ཆེན་ཐོབ་དང་། སྨན་གྱི་རྒྱལ་པོ་དང་། སྨན་གྱི་ཡང་དག་འཕགས་དང་། མཆོད་རྟེན་མངོན་པར་བསྒྲགས་པའི་སྒྲ་སྐད་རྒྱལ་པོ་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དྲུག་ཅུ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཞི་བ་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་གྱི་ཏིང་ངེ་འཛིན་ལ་གནས་པ།
en: Together with them were six septillion bodhisattvas, including such bodhisattvas as Mañjuśrī Kumārabhūta, Avalokiteśvara, Mahāsthāmaprāpta, Bhaiṣajyarāja, Bhaiṣajyasamudgata, and the bodhisattva King of the Sound Emanated by a Stūpa. The entire group of six septillion bodhisattvas all dwelled in the absorption of the miraculous power of certain tranquility;

source: ཟབ་ཅིང་བརྟན་པའི་ཆུའི་རྒྱ་མཚོའི་དུས་རླབས་ཀྱི་ཏིང་ངེ་འཛིན་ཐོབ་པ།
en: had attained the absorption that is like an ocean tide of deep, steady water;

source: དབང་བསྐུར་བའི་གཟུངས་ཐོབ་པ།
en: had attained the dhāraṇī of conferring empowerment;

source: སངས་རྒྱས་ཀྱི་སྐུ་མདོག་མཐའ་ཡས་པ་ཡོངས་སུ་འགྲུབ་པའི་གཟུངས་ཐོབ་པ་ཤ་སྟག་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: and had attained the dhāraṇī of achieving the limitless colors of the buddhas.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཕྱག་རྒྱ་གང་གིས་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མ་ངེས་ཏེ། བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱི་ལམ་ལས་ཕྱིར་ལྡོག་པར་འགྱུར་བའོ། །
en: Then Mañjuśrī Kumārabhūta asked the Blessed One, “How can one evaluate whether, for these bodhisattvas, it is uncertain that they will attain unsurpassable, perfect awakening, for they may turn back from the path leading to unsurpassable wisdom?

source: བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་ཏེ། བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱི་ལམ་ལས་ཕྱིར་མི་ལྡོག་པའོ་ཞེས་བགྱི་བར་བདག་གིས་འཚལ་བར་འགྱུར་བ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ངེས་པ་དང་མ་ངེས་པར་འགྲོ་བའི་ཕྱག་རྒྱ་ལ་འཇུག་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་བསྟན་དུ་གསོལ།
en: And how can one evaluate whether, for those bodhisattvas, it is certain that they will attain unsurpassable, perfect awakening, and they will not turn back from the path leading to unsurpassable wisdom? Please teach the Dharma discourse that is called evaluating whether a bodhisattva’s progress is certain or uncertain, so that I will understand it.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འགྲོ་བ་ནི་ལྔ་པོ་འདི་དག་ཡིན་ཏེ། ལྔ་གང་ཞེ་ན།
en: “Mañjuśrī,” the Blessed One replied, “there are five types of progress that bodhisattvas may make.

source: འདི་ལྟ་སྟེ། ཕྱུགས་ཀྱི་ཤིང་རྟས་འགྲོ་བ་ལྟ་བུ་དང་། གླང་པོ་ཆེའི་ཤིང་རྟས་འགྲོ་བ་ལྟ་བུ་དང་། ཟླ་བ་དང་ཉི་མས་འགྲོ་བ་ལྟ་བུ་དང་། ཉན་ཐོས་ཀྱི་རྫུ་འཕྲུལ་གྱིས་འགྲོ་བ་ལྟ་བུ་དང་། དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་གྱིས་འགྲོ་བ་ལྟ་བུ་སྟེ།
en: They are a bodhisattva’s progress that is like travel using a cattle cart, like travel using an elephant chariot, like travel using the moon and sun, like travel using the magical power of the śrāvakas, and like travel using the magical power of the Tathāgata.

source: འཇམ་དཔལ་ལྔ་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འགྲོ་བ་ཡིན་ནོ།
en: These are the five types of progress that bodhisattvas may make.

source: །འཇམ་དཔལ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཉིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མ་ངེས་པའི་འགྲོ་བ་པ་ཡིན་ནོ། །བྱང་ཆུབ་སེམས་དཔའ་གསུམ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པའི་འགྲོ་བ་པ་ཡིན་ནོ།
en: Mañjuśrī, in that regard, for two types of bodhisattva it is not certain that they will reach unsurpassable, perfect awakening, while for three types of bodhisattva it is certain that they will reach unsurpassable, perfect awakening.”

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མ་ངེས་པའི་འགྲོ་བ་པ་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱི་ལམ་ལས་སླར་ལྡོག་པ་དག་གང་ལགས།
en: “Blessed One, which are the bodhisattvas who are not certain to reach unsurpassable, perfect awakening, and who will turn back from the path leading to unsurpassable wisdom?” asked Mañjuśrī.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་ཕྱུགས་ཀྱི་ཤིང་རྟས་འགྲོ་བ་ལྟ་བུ་དང་། གླང་པོ་ཆེའི་ཤིང་རྟས་འགྲོ་བ་ལྟ་བུ་ཡིན་ཏེ།
en: “Mañjuśrī,” the Blessed One answered, “they are those bodhisattvas whose progress is like travel using a cattle cart and like travel using an elephant chariot.

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་གཉིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མ་ངེས་ཏེ། བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱི་ལམ་ལས་ཕྱིར་ལྡོག་པ་ཡིན་ནོ།
en: Those are the bodhisattvas who are not certain to reach unsurpassable, perfect awakening, and who will turn back from the path leading to unsurpassable wisdom.

source: །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་དང་ཉི་མས་འགྲོ་བ་ལྟ་བུ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་ཀྱི་རྫུ་འཕྲུལ་གྱིས་འགྲོ་བ་ལྟ་བུ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་གྱིས་འགྲོ་བ་ལྟ་བུ་པ་འདི་གསུམ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་ཏེ། བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱི་ལམ་ལས་ཕྱིར་མི་ལྡོག་པ་ཡིན་ནོ།
en: But the bodhisattvas whose progress is like travel using the moon and sun, like travel using the magical power of the śrāvakas, and like travel using the magical power of the Tathāgata—these three are the bodhisattvas who are certain to reach unsurpassable, perfect awakening, and who will not turn back from the path leading to unsurpassable wisdom.

source: །འཇམ་དཔལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཕྱུགས་ཀྱི་ཤིང་རྟས་འགྲོ་བ་ལྟ་བུ་པ་ཡིན་པར་རིག་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, you may wonder how one should understand bodhisattvas whose progress is like travel using a cattle cart.

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Mañjuśrī, they are like this:

source: སྐྱེས་བུ་ལ་ལ་ཞིག་སངས་རྒྱས་ཀྱི་ཞིང་ལྔ་བརྒྱའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྣམས་འདའ་བར་འདོད་ལ། དེར་ཡང་དེའི་བྱ་བ་དང་། བྱ་བ་ཆེན་པོ་དང་། དོན་དང་། དོན་ཆེན་པོ་དང་། ཆེད་ཆེ་བ་དང་། ཆེད་ཆེ་རབ་ཅིག་ཡོད་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Suppose someone wished to travel across as many world systems as are equal in number to the atoms in five hundred buddhafields, and suppose that they had business, important business, an objective, an important objective, urgent affairs, or extremely urgent affairs to attend to there.

source: བདག་གིས་བཞོན་པ་ཇི་ལྟ་བུ་ཞིག་གིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་འདའ་བར་བྱ་སྙམ་མོ། །དེ་ཡང་འདི་སྙམ་དུ་དཔྱོད་དེ།
en: They would think, ‘In what kind of vehicle shall I travel across those world systems?’ and then they might consider, ‘Well then, let me go by cattle cart.

source: མ་ལ་བདག་ཕྱུགས་ཀྱི་ཤིང་རྟ་ལ་ཞོན་ལ་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་འདའ་བར་བྱ་གོར་མ་ཆག་སྙམ་སྟེ། འཇམ་དཔལ་མི་དེ་ཕྱུགས་ཀྱི་ཤིང་རྟ་ལ་ཞོན་ཏེ་ལམ་དེར་ཞུགས་ནས།
en: I am sure to be able to travel across those world systems that way.’ Suppose they then climbed onto their cart and set off.

source: དེ་ཡུན་རིང་ཞིང་དུས་རིང་མོ་ཞིག་ན་དཔག་ཚད་བརྒྱར་ཕྱིན་པ་ལས།
en: After they had traveled for a very long time, they might have managed to travel a hundred yojanas, but then suppose they were driven back eighty yojanas by a great cyclone.

source: དེ་རླུང་གི་དཀྱིལ་འཁོར་ཆེན་པོས་དེ་ནས་བཟློག་ནས་དཔག་ཚད་བརྒྱད་ཅུར་ཕྱིར་དེད་དེ་ཕུལ་ན་འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས་མི་དེས་བསྐལ་པ་གཅིག་གམ།
en: In the best case, Mañjuśrī, what do you think?

source: བསྐལ་པ་བརྒྱའམ། བསྐལ་པ་སྟོང་ངམ། བསྐལ་པ་བྱེ་བ་ཕྲག་འབུམ་མམ། བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་འདའ་བའམ།
en: Could that person ever travel across those world systems, even if they traveled for an eon, or a hundred eons, or a thousand eons, or a trillion eons, or an inexpressible number of inexpressibly many eons?

source: འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཀྱང་འདའ་བར་ནུས་སམ།
en: Or could they travel across even one world system?”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་གནས་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་དེ་ནི་སྐབས་མ་མཆིས་ཏེ།
en: “Blessed One, that would be impossible—not feasible at all!” answered Mañjuśrī.

source: ཕྱུགས་ཀྱི་ཤིང་རྟ་ལ་འཚལ་བའི་མི་དེས་བསྐལ་པ་གཅིག་གམ། བསྐལ་པ་བརྒྱའམ། བསྐལ་པ་སྟོང་ངམ། བསྐལ་པ་བྱེ་བ་ཕྲག་འབུམ་མམ། བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཀྱང་འདའ་བར་ནུས་པ་དེ་ནི་གནས་མ་མཆིས་ལགས་སོ།
en: “Even if that person on the cattle cart traveled for an eon, or a hundred eons, or a thousand eons, or a trillion eons, or an inexpressible number of inexpressibly many eons, they could not travel across even one world system.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: That would be impossible!”

source: འཇམ་དཔལ་དེ་བཞིན་དུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ལ་ཐེག་པ་ཆེན་པོ་མི་འཛིན་མི་ཀློག་པར་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་དང་ལྷན་ཅིག་གནས་ཏེ། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དག་ལ་སྙེན་ཅིང་སྟེན་ལ་བསྙེན་བཀུར་བྱེད་ཅིང་དེ་དག་དང་ལྷན་ཅིག་ཏུ་འདྲིས་པར་བྱེད་ལ་ཀུན་ཏུ་སྤྱོད་ཅིང་ལོངས་སྤྱོད་པར་བྱེད་ལ། ཀུན་དགའ་ར་བའམ། གཙུག་ལག་ཁང་ངམ།
en: “Mañjuśrī, in the same way,” continued the Blessed One, “if certain sons or daughters of good family, having conceived the thought of attaining unsurpassable, perfect awakening, do not uphold or recite the Mahāyāna scriptures, but stay instead with followers of the Śrāvaka Vehicle and support, follow, and honor those followers of the Śrāvaka Vehicle;

source: འཆག་སར་སྤྱོད་ཡུལ་འཐུན་པར་གནས་པར་བྱེད།
en: and accustoming themselves to staying with them, they apply themselves to and practice that tradition;

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་ཀློག་ཅིང་ཁ་ཏོན་བྱེད། དཔྱོད་ཅིང་ཁོང་དུ་ཆུད་པར་བྱེད་ལ་གཞན་དག་ཀྱང་ཀློག་ཏུ་འཇུག་པ་ནས་ཁོང་དུ་ཆུད་པའི་བར་དུ་བྱེད་ན། དེ་ཉན་ཐོས་ཀྱི་ཐེག་པ་འཛིན་པའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་མངོན་པར་འདུ་བྱེད་པ་དེས་ཤེས་རབ་རྟུལ་པོར་འགྱུར་ཏེ། བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱི་ལམ་ལས་ཕྱིར་འདྲེན་ཅིང་ཕྱིར་ཟློག་གོ།
en: and staying in the same gardens, monasteries, or walking places with them, they read the śrāvaka scriptures, recite them, reflect on them, and understand them, encouraging others to read them, recite them, reflect on them, and understand them—through that conditioning of having produced a root of virtue by upholding the Śrāvaka Vehicle, their discriminating wisdom would become dull, and that would make them turn back from the path leading to unsurpassable wisdom.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེའི་བྱང་ཆུབ་ཀྱི་སེམས་བསྒོམས་པ་ལས་བྱུང་བའི་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་རབ་ཀྱི་མིག་གང་ཡིན་པ་དེ་ཡང་དེ་ཉན་ཐོས་ཀྱི་ཐེག་པ་འཛིན་ཅིང་འཆང་བའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་མངོན་པར་འདུ་བྱེད་པ་དེས་རྟུལ་པོར་བྱེད་ཅིང་ཉམས་པར་བྱེད་དོ།
en: The faculty and eye of discriminating wisdom that arise from those bodhisattvas cultivating the mind of awakening would be dulled and destroyed by the conditioning of having produced a root of virtue by upholding and maintaining the Śrāvaka Vehicle.

source: །འཇམ་དཔལ་དཔེར་ན་མི་ལ་ལ་ཞིག་མིག་ནད་ཀྱིས་མིག་ཟུམས་པར་གྱུར་ནས།
en: “Mañjuśrī, suppose a certain man’s eye has shut because of an eye disease.

source: དེ་མིག་དབྱེ་བ་དང་གཟུམས་སུ་རུང་བར་བྱ་བའི་ཕྱིར་ཟླ་བ་གཅིག་གི་བར་དུ་དཔྱད་བྱས་ཏེ། ཟླ་བ་གཅིག་ལོན་ནས་མིག་འབྱེད་ཅིང་འཛུམས་པར་བྱེད་པ་ལས། དེའི་དགྲའམ། མི་མཛའ་བ་གཞན་ཞིག་གིས་པི་པི་ལིང་གི་ཕྱེ་མ་སྤར་གང་གིས་མིག་བཀང་ནས་དེ་ཡང་ལོང་བར་བྱས་པ་དེ་བཞིན་དུ། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་དེའི་བྱང་ཆུབ་ཀྱི་སེམས་བསྒོམས་པ་ལས་བྱུང་བའི་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་རབ་ཀྱི་མིག་གང་ཡིན་པ་དེ་ཡང་དེ་ཉན་ཐོས་ཀྱི་ཐེག་པ་འཛིན་ཅིང་འཆང་བའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་མངོན་པར་འདུ་བྱེད་པ་དེས་རྟུལ་པོར་བྱེད་ཅིང་ཉམས་པར་བྱེད་དེ།
en: If, for the sake of restoring the eye’s ability to open and close again, the eye were examined for one month, and if after a month had passed, rather than the eye being made to open and close, instead that person’s enemy or adversary filled that eye with a handful of powdered long pepper and thus blinded that eye, just so Mañjuśrī, the faculty and eye of discriminating wisdom that arise from those bodhisattvas cultivating the mind of awakening would be dulled and destroyed by the conditioning of having produced a root of virtue by upholding and maintaining the Śrāvaka Vehicle.

source: འཇམ་དཔལ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཕྱུགས་ཀྱི་ཤིང་རྟས་འགྲོ་བ་ལྟ་བུ་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Mañjuśrī, you should understand such bodhisattvas to be those whose progress is like travel using a cattle cart.

source: །འཇམ་དཔལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་གླང་པོ་ཆེའི་ཤིང་རྟས་འགྲོ་བ་ལྟ་བུ་པ་ཡིན་པར་རིག་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, you may wonder how one should understand bodhisattvas whose progress is like travel using an elephant chariot.

source: འཇམ་དཔལ་དཔེར་ན་མི་ལ་ལ་ཞིག་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཉིད་འདའ་བར་འདོད་ལ། དེར་ཡང་དེའི་བྱ་བ་དང་། བྱ་བ་ཆེན་པོ་དང་། དོན་དང་། དོན་ཆེན་པོ་དང་། ཆེད་ཆེ་བ་དང་། ཆེད་ཆེ་རབ་ཅིག་ཡོད་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Suppose, Mañjuśrī, that someone wished to travel across those very world systems, and suppose that they had business, important business, an objective, an important objective, urgent affairs, or extremely urgent affairs to attend to there.

source: བདག་གིས་བཞོན་པ་ཇི་ལྟ་བུ་ཞིག་གིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་འདའ་བར་བྱ་སྙམ་མོ། དེ་ཡང་འདི་སྙམ་དུ་སྤྱོད་དེ། མ་ལ་བདག་གླང་པོ་ཆེའི་ཤིང་རྟ་ཡན་ལག་བརྒྱད་དང་ལྡན་པ་ལ་ཞོན་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་འདའ་བར་བྱ་གོར་མ་ཆག་སྙམ་ནས། འཇམ་དཔལ་མི་དེ་གླང་པོ་ཆེའི་ཤིང་རྟ་ཡན་ལག་བརྒྱད་དང་ལྡན་པ་ལ་ཞོན་ཏེ་ལམ་དེར་ཞུགས་ནས།
en: They would think, ‘In what kind of vehicle shall I travel across those world systems?’ and then they might consider, ‘Well then, let me go by an eight-part elephant chariot. I am sure to be able to travel across those world systems that way.’ Suppose they then climbed onto their eight-part elephant chariot and set off.

source: དེ་ལོ་བརྒྱས་དཔག་ཚད་ཉིས་སྟོང་དུ་སོན་པ་ལས་རླུང་གི་དཀྱིལ་འཁོར་ཆེན་པོས་དེ་ནས་ཕྱིར་ཕུལ་ཏེ་བཟློག་ན།
en: After they had traveled for a hundred years, they might have managed to travel two thousand yojanas, but then suppose they were driven back by a great cyclone.

source: འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས།
en: In that case, Mañjuśrī, what do you think?

source: གླང་པོ་ཆེའི་ཤིང་རྟ་ལ་ཞོན་པའི་མི་དེས་བསྐལ་པ་གཅིག་གམ། བསྐལ་པ་བརྒྱའམ། བསྐལ་པ་སྟོང་ངམ། བསྐལ་པ་བྱེ་བ་ཕྲག་འབུམ་མམ། བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཀྱང་འདའ་བར་ནུས་སམ།
en: Could that person who rode the elephant chariot ever travel across even one single world system, even if they traveled for an eon, or a hundred eons, or a thousand eons, or a trillion eons, or an inexpressible number of inexpressibly many eons?”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་གནས་མ་མཆིས་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་ནི་སྐབས་མ་མཆིས་ཏེ།
en: “Blessed One, that would be impossible—not feasible at all!” answered Mañjuśrī.

source: གླང་པོ་ཆེའི་ཤིང་རྟ་འཚལ་བའི་མི་དེས་བསྐལ་པ་གཅིག་གམ། བསྐལ་པ་བརྒྱའམ། བསྐལ་པ་སྟོང་ངམ། བསྐལ་པ་བྱེ་བ་ཕྲག་འབུམ་མམ། བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཀྱང་འདའ་བར་ནུས་པ་དེ་ནི་གནས་མ་མཆིས་ལགས་སོ།
en: “Even if that person on the elephant chariot were to travel for an eon, or a hundred eons, or a thousand eons, or a trillion eons, or an inexpressible number of inexpressibly many eons, they could not travel across even one world system. That would be impossible!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་དེ་བཞིན་དུ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དག་དང་ལྷན་ཅིག་གནས་ཏེ། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དག་ལ་སྙེན་ཅིང་སྟེན་ལ་བསྙེན་བཀུར་བྱེད་ཅིང་དེ་དག་དང་ལྷན་ཅིག་ཏུ་འདྲིས་པར་བྱེད་ལ་ཀུན་སྤྱོད་ཅིང་ལོངས་སྤྱོད་པར་བྱེད་ལ། ཀུན་དགའ་ར་བའམ། གཙུག་ལག་ཁང་ངམ། འཆག་སར་སྤྱོད་ཡུལ་འཐུན་པར་གནས་པར་བྱེད། ཉན་ཐོས་ཀྱི་ཐེག་པ་ཀློག་ཅིང་ཁ་ཏོན་བྱེད། དཔྱོད་ཅིང་ཁོང་དུ་ཆུད་པར་བྱེད་ལ་གཞན་དག་ཀྱང་ཀློག་ཏུ་འཇུག་པར་བྱེད་ཅིང་ཁ་ཏོན་བྱེད་དུ་འཇུག་ལ་ཡོངས་སུ་སྦྱོང་བར་བྱེད་དུ་འཇུག་ན་དེ་ཉན་ཐོས་ཀྱི་ཐེག་པ་འཛིན་པའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་མངོན་པར་འདུ་བྱེད་པ་དེས་ཤེས་རབ་རྟུལ་པོར་འགྱུར་ཏེ། བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱི་ལམ་ལས་ཕྱིར་འདྲེན་ཅིང་ཕྱིར་ཟློག་གོ།
en: “Mañjuśrī, in the same way,” the Blessed One continued, “if certain sons or daughters of good family, having conceived the thought of attaining unsurpassable, perfect awakening, stay with followers of the Śrāvaka Vehicle and support, follow, and honor those followers of the Śrāvaka Vehicle; and accustoming themselves to staying with them, they apply themselves to and practice that tradition; and staying in the same gardens, monasteries, or walking places with them, they read the śrāvaka scriptures, recite them, reflect on them, and understand them, encouraging others to read them, recite them, and practice them—through that conditioning of having produced a root of virtue by upholding the Śrāvaka Vehicle, their discriminating wisdom would become dull, and that would make them turn back from the path leading to unsurpassable wisdom.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེའི་བྱང་ཆུབ་ཀྱི་སེམས་བསྒོམས་པ་ལས་བྱུང་བའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་མངོན་པར་འདུ་བྱེད་པའི་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་རབ་ཀྱི་མིག་གང་ཡིན་པ་དེ་ཡང་དེའི་ཉན་ཐོས་ཀྱི་ཐེག་པ་འཛིན་ཅིང་འཆང་བའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་མངོན་པར་འདུ་བྱེད་པ་དེས་རྟུལ་པོར་བྱེད་ཅིང་ཉམས་པར་བྱེད་དོ།
en: “The faculty and eye of discriminating wisdom that are the conditioning of having produced a root of virtue that arises from those bodhisattvas cultivating the mind of awakening would be dulled and destroyed by the conditioning of having produced a root of virtue by upholding and maintaining the Śrāvaka Vehicle.

source: །འཇམ་དཔལ་དཔེར་ན་ཤིང་གི་སྡོང་པོ་ཆེན་པོ་སྲིད་དུ་དཔག་ཚད་སྟོང་པ་ཞིག་ཡོད་ལ། དེ་ཡང་རྒྱ་མཚོ་ཆེན་པོས་ཁྱེར་བ་ལས་བར་སྣང་ལ་གནས་པའི་གནོད་སྦྱིན་དག་གིས་དེ་རྒྱ་མཚོ་ཆེན་པོའི་ལམ་ལས་ཕྱིར་ཕུལ་ཏེ་བཟློག་ནས།
en: Mañjuśrī, suppose that there existed a huge tree trunk that was a thousand yojanas long, and rather than be carried away by the ocean, it was driven back by sky-dwelling yakṣas from its course through the ocean.

source: དེ་ལ་ལྕགས་ཀྱི་གར་བུ་དཔག་ཚད་ལྔ་སྟོང་ཡོད་པ་ཞིག་བཏགས་ན། འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས།
en: And if they then attached to it a lump of iron five thousand yojanas tall, Mañjuśrī, what do you think?

source: ཤིང་གི་སྡོང་པོ་ཆེན་པོ་དེ་རྒྱ་མཚོ་ཆེན་པོ་ལ་འགྲོ་བ་འམ། སེམས་ཅན་བསྒྲལ་བའི་ཕྱིར་སྤྱད་པར་ནུས་སམ།
en: Would that huge tree trunk be able to move through the ocean or be used by beings to cross it?”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །
en: “No, Blessed One,” replied Mañjuśrī.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེའི་བྱང་ཆུབ་ཀྱི་སེམས་བསྒོམས་པ་ལས་བྱུང་བའི་ཤེས་རབ་ཀྱི་ཤིང་ཆེན་པོ་ཡང་ཉན་ཐོས་ཀྱི་ཐེག་པ་འཛིན་པའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་མངོན་པར་འདུ་བྱེད་པ་དེས། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་རྒྱ་མཚོ་ལས་ཕྱིར་ཕུལ་ཞིང་བཟློག་སྟེ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་རྒྱ་མཚོར་འགྲོ་བར་ཡང་མི་འགྱུར། འཁོར་བའི་རྒྱ་མཚོ་ལས་ཀྱང་སེམས་ཅན་རྣམས་སྒྲོལ་མི་ནུས་ཏེ།
en: “In the same way, Mañjuśrī,” continued the Blessed One, “the tree of discriminating wisdom that arises from those bodhisattvas cultivating the mind of awakening will be driven back from the ocean of omniscient wisdom by their conditioning of having produced a root of virtue by upholding the Śrāvaka Vehicle, and they will not move through the ocean of omniscient wisdom or be able to ferry beings across the ocean of cyclic existence.

source: འཇམ་དཔལ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་གླང་པོ་ཆེའི་ཤིང་རྟས་འགྲོ་བ་ལྟ་བུ་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Mañjuśrī, you should understand such bodhisattvas to be those whose progress is like travel using an elephant chariot.

source: །འཇམ་དཔལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་དང་ཟླ་བས་འགྲོ་བ་ལྟ་བུ་པ་ཡིན་པར་རིག་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, you may wonder how one should understand bodhisattvas whose progress is like travel using the sun and moon.

source: བདག་གིས་རྫུ་འཕྲུལ་ཇི་ལྟ་བུ་ཞིག་གིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་འདའ་བར་བྱ་སྙམ་མོ། །དེ་ཡང་འདི་སྙམ་དུ་དཔྱོད་དེ། མ་ལ་བདག་གིས་ཉི་མ་དང་ཟླ་བའི་འགྲོ་བས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་འདའ་བར་བྱ་གོར་མ་ཆག་སྙམ་ནས།
en: They would think, ‘Using what kind of magical power shall I travel across those world systems?’ and then they might consider, ‘Well then, let me go using the sun and moon.

source: འཇམ་དཔལ་མི་དེ་ཉི་མ་དང་ཟླ་བའི་འགྲོ་བས་ལམ་དེར་ཞུགས་ན།
en: I am sure to be able to travel across those world systems that way.’ Suppose they then set off using the sun and moon.

source: མི་དེས་ཉི་མ་དང་ཟླ་བའི་འགྲོ་བས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་འདའ་བར་ནུས་སམ།
en: Could that person who went using the sun and moon travel across those world systems?”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་རྔོ་ཐོགས་ལགས་སོ།
en: “Blessed One, they would be able to,” replied Mañjuśrī.

source: །བདེ་བར་གཤེགས་པ་རྒྱུད་དེའི་ལོ་དུས་རིང་མོ་ཞིག་གིས་རྔོ་ཐོགས་ལགས་སོ།
en: “Sugata, eventually, after a long period of time, they would be able to.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་དེ་བཞིན་དུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དག་དང་ལྷན་ཅིག་ཏུ་མི་གནས་ཏེ། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དག་ལ་མི་སྙེན་ཅིང་མི་སྟེན་ལ། བསྙེན་བཀུར་མི་བྱེད་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་འདྲིས་པར་མི་བྱེད།
en: “Mañjuśrī, in the same way,” continued the Blessed One, “if certain sons or daughters of good family, having conceived the thought of attaining unsurpassable, perfect awakening, do not stay with followers of the Śrāvaka Vehicle or support, follow, or honor those followers of the Śrāvaka Vehicle;

source: ཀུན་ཏུ་སྤྱོད་ཅིང་ལོངས་སྤྱོད་པར་མི་བྱེད། ཀུན་དགའ་ར་བ་འམ། གཙུག་ལག་ཁང་ངམ། འཆག་སར་སྤྱོད་ཡུལ་འཐུན་པར་གནས་པར་མི་བྱེད་ལ། ཉན་ཐོས་ཀྱི་ཐེག་པ་ཀློག་པར་མི་བྱེད། ཁ་ཏོན་མི་བྱེད། སེམས་པར་མི་བྱེད་ལ། གཞན་དག་ཀྱང་ཐ་ན་ཚིགས་སུ་བཅད་པ་གཅིག་ཙམ་ཡང་ཀློག་ཏུ་འཇུག་པར་མི་བྱེད། ཁ་ཏོན་བྱེད་དུ་འཇུག་པར་མི་བྱེད་དེ། དེ་གང་ཀློག་པ་དེ་ཡང་ཐེག་པ་ཆེན་པོ་ཁོ་ན་ཀློག་ལ། གང་སྟོན་པ་དེ་ཡང་ཐེག་པ་ཆེན་པོ་ཁོ་ན་སྟོན་ན། འཇམ་དཔལ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་དང་ཉི་མའི་འགྲོ་བ་ལྟ་བུ་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: and not accustoming themselves to staying with them, they do not apply themselves to or practice that tradition; and not staying in the same gardens, monasteries, or walking places with them, they do not read the śrāvaka scriptures, recite them, or contemplate them, nor encourage others to read or recite even so much as a single verse from them—if what they do read is only the Mahāyāna, and what they teach is only the Mahāyāna, then Mañjuśrī, you should understand such bodhisattvas to be those whose progress is like travel using the moon and sun.

source: །འཇམ་དཔལ་དཔེར་ན་ནམ་མཁའ་ལྡིང་གི་དབང་པོའི་རྒྱལ་པོ་ཆེན་པོ་ལང་ཚོ་དང་། སྟོབས་དང་། མཐུ་ཆེན་པོ་ཐོབ་པ་ནི་འདོད་ན་རི་རབ་ཀྱི་རྩེ་མོ་ནས་རི་རབ་ཀྱི་རྩེ་མོར་འགྲོའོ།
en: “As an analogy Mañjuśrī, the great and mighty king of the garuḍas who has reached maturity and has gained strength and great power could, if he wanted to, fly from the top of the central mountain of one world system to that of the next world system.

source: །འཇམ་དཔལ་དེ་བཞིན་དུ་ཟླ་བ་དང་ཉི་མའི་འགྲོ་བ་ལྟ་བུ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། བསམ་པ་དང་ལྷག་པའི་བསམ་པའི་སྟོབས་དང་། ལང་ཚོ་དང་། མཐུ་ཆེན་པོ་ཐོབ་པ་ཡང་འདོད་ན། སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་ཞིང་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྣམས་སུ་སྟོན་པར་བྱེད་དོ།
en: Mañjuśrī, in the same way, bodhisattvas whose progress is like travel using the moon and sun possess the strength of moral discipline, learning, reflection, and altruism; they have attained maturity and great power, and if they wanted to, they could go from one buddhafield to another and teach those among the disciples of the tathāgatas.

source: །འཇམ་དཔལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་ཀྱི་རྫུ་འཕྲུལ་གྱིས་འགྲོ་བ་ལྟ་བུ་པ་ཡིན་པར་རིག་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, you may wonder how one should understand bodhisattvas whose progress is like travel using the magical power of the śrāvakas.
